{"allTrials": {"@totalCount": "1", "@xmlns": "http://www.67bricks.com/isrctn", "fullTrial": {"trial": {"@lastUpdated": "2010-06-30T00:00:00.000Z", "@version": "24", "isrctn": {"@dateAssigned": "2008-02-14T00:00:00.000Z", "#text": "71916001"}, "trialDescription": {"@thirdPartyFilesAcknowledgement": "false", "acknowledgment": "true", "title": "A phase III, multicentre, randomised, double-blind, placebo-controlled study, with open-label follow on, to evaluate the efficacy, safety and tolerability of PSD502 in subjects with Premature Ejaculation (PE)", "scientificTitle": null, "acronym": null, "studyHypothesis": "PSD502 is a metered dose spray containing a mixture of lidocaine and prilocaine which is under development by Plethora Solutions Ltd as a topical anaesthetic treatment for Premature Ejaculation (PE). The spray is applied to the glans penis a short time prior to intercourse.\n\nMost studies evaluating treatments for PE include intravaginal ejaculatory latency time (IELT) in the definition of PE. It has been estimated that PE affects 30 - 40% of the male population, but is paradoxically a condition for which they are least likely to seek help.\n\nMen with PE exhibit abnormal autonomic reflex pathways for the ejaculatory process. These include lower vibratory threshold to ejaculation, shorter bulbocavernous latency time and higher bulbocavernous evoked potentials. Reducing the heightened sensitivity of the glans penis with topical anaesthetics might therefore be a way of improving IELT, without adversely affecting the sensation of ejaculation. \n\nAlthough IELT is an objective measure of ejaculatory function it does not address the impact of therapy on patients\u0092 well being and confidence in their sexual performance, which are important markers of treatment benefit. Therefore, if IELT is used as a sole efficacy measure it may not fully characterise the treatment benefit to the patient. For this reason, a patient reported outcome (PRO) known as the Index of Premature Ejaculation (IPE) will be used in this study in conjunction with IELT to evaluate efficacy. Thus the combination of the objective measure of ejaculatory latency with the PRO of IPE should be able to provide efficacy data which are representative of clinical benefit to the patient.\n\nThe use of lidocaine, prilocaine and eutectic mixture of lidocaine and prilocaine (EMLAÂ®) cream as topical anaesthetics is well established. Many years of experience of use in large numbers of patients, as well as comprehensive non-clinical safety testing programs for various formulations of lidocaine and prilocaine exist, to support their safety and tolerability. This information, together with the clinical data from three studies with PSD502 (ANAE-059-00, PSD502-PE-001, and PSD502-PE-003), suggest that PSD502 may have beneficial effects in reducing penile sensation and prolonging IELT, and its use is unlikely to be associated with significant clinical safety or tolerability concerns.\n\nThe aim of this study is to provide additional placebo-controlled efficacy data to establish the clinical utility of PSD502 in the treatment of PE. In addition, long term open-label efficacy and safety data will be collected, to further support the registration package for PSD502 in the indication of treatment of PE.\n\nAs of 29/01/2010, this record was updated; all amendments can be found under the relevant section with the above update date. At this time the actual trial dates were added to the record, the initial anticipated trial dates were as follows:\nInitial anticipated start date: 17/12/2007\nInitial anticipated end date: 31/12/2008", "plainEnglishSummary": "Not provided at time of registration", "primaryOutcome": "To evaluate efficacy of treatment with PSD502 compared with placebo in subjects with PE as measured by:\n1. Changes in mean IELT from baseline to during three-month double-blind treatment \n2. Changes in selected IPE domains from baseline to month three", "secondaryOutcome": "1. Change in selected IPE domains from baseline to three months\n2. Proportion of subjects with short mean IELT during the three months of double-blind treatment\n3. Change in mean IELT from baseline \n4. Subject and partner PEP scores \n5. Evaluation of the safety and tolerability of PSD502 compared with placebo in subjects with PE as measured by adverse event (AE) and serious adverse event (SAE) data for both the subject and his sexual partner, collected throughout the study", "trialWebsite": null, "ethicsApprovalRequired": "Old ethics approval format", "ethicsCommittees": null, "ethicsApproval": "Ethics approval received from the following institutional review boards:\n1. Ethics Committee of FN Brno (Czech Republic) on the 12th September 2007 (ref: 073/07MEC)\n2. Local Ethics Committee (Komisja Bioetyczna przy Okregowej Izbie Lekarskiej w Lodzi) (Poland) on the 14th November 2007\n3. HSC Research Ethics Committee (UK) on the 30th October 2007 (ref: 07/NIR03/07)\n\nAdded 29/01/2010:\n4. Medical Research Council Ethics Committee for Clinical Pharmacology (Hungary) on the 29th January 2008"}, "externalRefs": {"doi": "10.1186/ISRCTN71916001", "eudraCTNumber": null, "irasNumber": null, "clinicalTrialsGovNumber": null, "protocolSerialNumber": "PSD502-PE-004"}, "trialDesign": {"studyDesign": "This is a phase III, multicentre, randomised, double-blind, placebo-controlled study with open label follow on. Subjects will be randomised to PSD502 or placebo in a 2:1 ratio.", "primaryStudyDesign": "Interventional", "secondaryStudyDesign": "Randomised controlled trial", "trialSettings": {"trialSetting": "Hospital"}, "trialTypes": {"trialType": "Treatment"}, "overallStatusOverride": null, "reasonAbandoned": null, "overallStartDate": "2007-12-18T00:00:00.000Z", "overallEndDate": "2009-07-16T00:00:00.000Z"}, "participants": {"recruitmentCountries": {"country": ["Czech Republic", "Hungary", "Northern Ireland", "Poland", "United Kingdom"]}, "trialCentres": {"trialCentre": {"@id": "9cd64b4c-27b0-4b9d-9476-27d44f127827", "name": "Consultant in GU Medicine", "address": null, "city": "Belfast", "state": null, "country": "United Kingdom", "zip": "BT12 6BA"}}, "participantTypes": {"participantType": "Patient"}, "inclusion": "Current information as of 29/01/2010:\nA subject will be considered suitable for the study if he fulfils all of the following criteria:\n1. Willing and able to provide written informed consent\n2. Male and aged 18 years and over\n3. Diagnosed with PE according to Diagnostic and Statistical Manual of Mental Disorders, 4th Edition (DSM-IV) criteria and International Society for Sexual Medicine (ISSM) definition \n4. Has lifelong PE\n5. Acceptable response to baseline premature ejaculation profile (PEP)\n6. Subject must be in a stable heterosexual and monogamous relationship and the partner must provide consent \n7. Acceptable sexual encounters in the baseline period\n\nInitial information at time of registration:\nA subject will be considered suitable for the study if he fulfils all of the following criteria:\n1. Willing and able to provide written informed consent\n2. Male and aged 18 years and over\n3. Diagnosed with PE \n4. Acceptable response to baseline premature ejaculation profile (PEP)\n5. Subject must be in a stable heterosexual and monogamous relationship and the partner must provide consent \n6. Acceptable sexual encounters in the baseline period", "ageRange": "Adult", "lowerAgeLimit": {"@unit": "Years", "@value": "18.0"}, "gender": "Male", "targetEnrolment": "300", "totalFinalEnrolment": null, "totalTarget": "240 - 300", "exclusion": "A subject or his sexual partner where stated, who fulfils any of the following criteria will be excluded from the study:\n1. Subject, or his sexual partner, has received an investigational (non-registered) drug within 30 days of screening\n2. Subject has erectile dysfunction\n3. The subject, or his sexual partner, has a physical or psychological condition that would prevent them from undertaking the study procedures, including, but not limited to, the following:\n3.1. Urological disease \n3.2. Ongoing significant psychiatric disorder not controlled by medication\n4. Subject has safety testing abnormalities at the screening visit \n5. Subjects taking excluded medications or receiving any treatment for PE\n6. Subject, or his sexual partner, has a current history of alcohol or drug abuse\n7. The subject, or his sexual partner, is unlikely to understand or be able to comply with study procedures, for whatever reasons\n8. Subject, or his sexual partner, has known drug sensitivity to amide-type local anaesthetics\n9. Subjects with pregnant partners \n10. Subject with sexual partners of child-bearing potential and not using appropriate contraception \n11. Subject, or his sexual partner, has a history of glucose-6-phosphate dehydrogenase (G-6-PD) deficiency or use of medications that would increase susceptibility to methemoglobinemia (e.g. anti-malarial agents)", "patientInfoSheet": "Not available in web format, please use the contact details below to request a patient information sheet", "recruitmentStart": "2007-12-18T00:00:00.000Z", "recruitmentEnd": "2009-07-16T00:00:00.000Z", "recruitmentStatusOverride": null}, "conditions": {"condition": {"description": "Premature ejaculation", "diseaseClass1": "Urological and Genital Diseases", "diseaseClass2": "Premature ejaculation"}}, "interventions": {"intervention": {"description": "PSD502 is a metered dose aerosol spray that delivers a eutectic mixture of lidocaine and prilocaine. The placebo is a metered dose aerosol spray that is identical in appearance to the PSD502 spray and contains the same propellant. Subjects will be randomised to PSD502 or placebo in a 2:1 ratio. A single dose of PSD502 or placebo consists of three sprays applied to the glans penis.\n\nSubjects will continue for a three-month double blind treatment followed by 5 months open label treatment.", "interventionType": "Drug", "pharmaceuticalStudyTypes": null, "phase": "Phase III", "drugNames": "PSD502"}}, "results": {"publicationPlan": "Not provided at time of registration", "ipdSharingStatement": null, "dataPolicies": {"dataPolicy": "Not provided at time of registration"}, "publicationDetails": "2009 Results article in http://www.ncbi.nlm.nih.gov/pubmed/19245438 results", "publicationStage": "Results", "biomedRelated": "false", "basicReport": null, "plainEnglishReport": null}, "outputs": {"output": {"@id": "d5257d26-a779-4fad-b51b-9493a78176bf", "@outputType": "resultsarticle", "@artefactType": "ExternalLink", "@dateCreated": "2009-04-01T00:00:00.000Z", "@dateUploaded": "", "@peerReviewed": "true", "@patientFacing": "false", "@createdBy": "Data migration", "externalLink": {"@url": "http://www.ncbi.nlm.nih.gov/pubmed/19245438"}, "description": "results", "productionNotes": null}}, "parties": {"funderId": "Funder17397-0", "contactId": "Contact55358_17397", "sponsorId": "Sponsor53928"}, "miscellaneous": {"@xmlns:ssb": "http://www.67bricks.com/isrctn/functions", "ipdSharingPlan": "No"}, "attachedFiles": null}, "contact": {"@id": "Contact55358_17397", "title": "Prof", "forename": "Wallace", "surname": "Dinsmore", "orcid": null, "contactTypes": {"@xmlns:ssb": "http://www.67bricks.com/isrctn/functions", "contactType": "Scientific"}, "contactDetails": {"address": "Consultant in GU Medicine\nRoyal Victoria Hospital", "city": "Belfast", "country": "United Kingdom", "zip": "BT12 6BA", "telephone": {"@xmlns:ssb": "http://www.67bricks.com/isrctn/functions", "#text": "+44 (0)28 9089 4609"}, "email": {"@xmlns:ssb": "http://www.67bricks.com/isrctn/functions", "#text": "wallacedinsmore@hotmail.com"}}, "privacy": "Public"}, "sponsor": {"@id": "Sponsor53928", "organisation": "Plethora Solutions Limited (UK)", "website": "http://www.plethorasolutions.co.uk", "sponsorType": "Industry", "contactDetails": {"address": "4th Floor, 233 High Holborn", "city": "London", "country": "United Kingdom", "zip": "WC1V 7DN", "telephone": {"@xmlns:ssb": "http://www.67bricks.com/isrctn/functions", "#text": "+44 (0)20 3077 5400"}, "email": {"@xmlns:ssb": "http://www.67bricks.com/isrctn/functions", "#text": "mail@plethorasolutions.co.uk"}}, "privacy": "Public", "gridId": "grid.487437.b", "rorId": "https://ror.org/02y9vw172"}, "funder": {"@id": "Funder17397-0", "name": "Plethora Solutions Limited (UK)", "fundRef": null}}}}